package mymessenger;

/**
 * Разработать "мессенджер". Нужен следующий функционал:
 *- различные виды пользователей: обычный user, админ, модератор и т.д. 
 *  Наделить пользователей различными ролями.
 *- различные хранилища: сообщения, пользователи и т.д.
 *- продумать модель сообщений: дата отправки, возможность редактирования, 
 *  возможность удаления, дата обновления сообщения.
 *
 * Дополнительно:
 *- поиск по сообщениям;
 *- проявить фантазию и добавить свой функционал.
 */
public class App {
    public static void main(String[] args) {
        
    }
}
